; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Plant watering domain - metric-ff version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; An agent on a grid-like map aims pos watering some plants by
;;; carrying water from a tap to the plants.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; Adapted to do away with the grid (Enrico Scala & Miquel Ramirez, August 2015)
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain mt-plant-watering-constrained)
    (:types thing location - object
        agent plant tap - thing)
   ; (:predicates
    ;    (CONNECTED ?x ?y - location) ;; Whether two locations are connected.
    ;)

    (:functions
        (maxx) ;; bounds
        (maxy) ;; bounds
        (miny) ;; bounds
        (minx) ;; bounds
        (x ?t - thing) ;; x coordinate of the location for ?t
        (y ?t - thing) ;; y coordinate of the location for ?t
        (carrying) ;; The amount of water carried by the agent.
        (poured ?p - plant) ;; The amount of water poured to the plant so far.
        (total_poured) ;; The total amount of water poured so far.
        (total_loaded) ;; The total amount of water retrieved from the tap.
        (max_int) ;; The maximum integer we consider - a static value
    )

    ;; Move an agent to a neighboring location
    (:action move_up
     :parameters (?a - agent)
     :precondition (and (<= (+ (y ?a) 1) (maxy)))
     :effect (and
    		(increase (y ?a) 1)))

    (:action move_down
     :parameters (?a - agent)
     :precondition (and (>= (- (y ?a) 1) (miny)))
     :effect (and
    		(decrease (y ?a) 1)))

    (:action move_right
     :parameters (?a - agent)
     :precondition (and (<= (+ (x ?a) 1) (maxx)))
     :effect (and
    		(increase (x ?a) 1)))

    (:action move_left
     :parameters (?a - agent)
     :precondition (and (>= (- (x ?a) 1) (minx)))
     :effect (and
    		(decrease (x ?a) 1)))

  (:action move_up_left
   :parameters (?a - agent)
   :precondition (and (>= (- (x ?a) 1) (minx)) (<= (+ (y ?a) 1) (maxy)))
   :effect (and
      (increase (y ?a) 1) (decrease (x ?a) 1)))

  (:action move_up_right
   :parameters (?a - agent)
   :precondition (and (<= (+ (x ?a) 1) (maxx)) (<= (+ (y ?a) 1) (maxy)))
   :effect (and
      (increase (y ?a) 1) (increase (x ?a) 1)))

  (:action move_down_left
   :parameters (?a - agent)
   :precondition (and (>= (- (x ?a) 1) (minx)) (>= (- (y ?a) 1) (miny)))
   :effect (and
      (decrease (x ?a) 1) (decrease (y ?a) 1) )
  )

(:action move_down_right
 :parameters (?a - agent)
 :precondition (and (<= (+ (x ?a) 1) (maxx)) (>= (- (y ?a) 1) (miny)))
 :effect (and
    (decrease (y ?a) 1) (increase (x ?a) 1)))

    ;; Load one unit of water from a tap into the agent's bucket.
    (:action load
    :parameters (?a - agent ?t - tap)
    :precondition (and (= (x ?a) (x ?t)) (=(y ?a) (y ?t))
                       (<= (+ (total_loaded) 1) (max_int))
                       (<= (+ (carrying) 1) (max_int))
                  )
    :effect       (and (increase (carrying) 1) (increase (total_loaded) 1))
    )

    ;; Pours one unit of water from the agent's bucket into a plant.
    (:action pour
    :parameters (?a - agent ?p - plant)
    :precondition (and (= (x ?a) (x ?p)) (=(y ?a) (y ?p))
                       (>= (carrying) 1)
                       (<= (+ (total_poured) 1) (max_int))
                       (<= (+ (poured ?p) 1) (max_int))
                  )
    :effect       (and
                    (decrease (carrying) 1)
                    (increase (poured ?p) 1)
                    (increase (total_poured) 1)
                  )
    )
)

; problem
(define (problem instance_4_1_1)
  (:domain mt-plant-watering-constrained)
  (:objects
    agent1 - agent
	tap1 - tap
	plant1 - plant
  )

  (:init
    (= (max_int) 20)
	(= (maxx) 4)
	(= (minx) 1)
	(= (maxy) 4)
	(= (miny) 1)
	(= (carrying) 0)
	(= (total_poured) 0)
	(= (total_loaded) 0)
	(= (poured plant1) 0)
	(= (x agent1) 1)
	(= (y agent1) 3)
	(= (x plant1) 2)
	(= (y plant1) 2)
	(= (x tap1) 4)
	(= (y tap1) 4)
  )

  (:goal (and 
    (= (poured plant1) 4)
	(= (total_poured) (poured plant1) )
  ))

  
  

  
)

; plan
1. (move_up_right agent1)
   changed: (y agent1) from 3 to 4, (x agent1) from 1 to 2
   goals met: 1 of 2
2. (move_right agent1)
   changed: (x agent1) from 2 to 3
   goals met: 1 of 2
3. (move_right agent1)
   changed: (x agent1) from 3 to 4
   goals met: 1 of 2
4. (load agent1 tap1)
   changed: (carrying) from 0 to 1, (total_loaded) from 0 to 1
   goals met: 1 of 2
5. (move_down_left agent1)
   changed: (x agent1) from 4 to 3, (y agent1) from 4 to 3
   goals met: 1 of 2
6. (move_down_left agent1)
   changed: (x agent1) from 3 to 2, (y agent1) from 3 to 2
   goals met: 1 of 2
7. (pour agent1 plant1)
   changed: (carrying) from 1 to 0, (poured plant1) from 0 to 1, (total_poured) from 0 to 1
   goals met: 1 of 2
8. (move_up_right agent1)
   changed: (y agent1) from 2 to 3, (x agent1) from 2 to 3
   goals met: 1 of 2
9. (move_up_right agent1)
   changed: (y agent1) from 3 to 4, (x agent1) from 3 to 4
   goals met: 1 of 2
10. (load agent1 tap1)
   changed: (carrying) from 0 to 1, (total_loaded) from 1 to 2
   goals met: 1 of 2
11. (move_down_left agent1)
   changed: (x agent1) from 4 to 3, (y agent1) from 4 to 3
   goals met: 1 of 2
12. (move_down_left agent1)
   changed: (x agent1) from 3 to 2, (y agent1) from 3 to 2
   goals met: 1 of 2
13. (pour agent1 plant1)
   changed: (carrying) from 1 to 0, (poured plant1) from 1 to 2, (total_poured) from 1 to 2
   goals met: 1 of 2
14. (move_up_right agent1)
   changed: (y agent1) from 2 to 3, (x agent1) from 2 to 3
   goals met: 1 of 2
15. (move_up_right agent1)
   changed: (y agent1) from 3 to 4, (x agent1) from 3 to 4
   goals met: 1 of 2
16. (load agent1 tap1)
   changed: (carrying) from 0 to 1, (total_loaded) from 2 to 3
   goals met: 1 of 2
17. (move_down_left agent1)
   changed: (x agent1) from 4 to 3, (y agent1) from 4 to 3
   goals met: 1 of 2
18. (move_down_left agent1)
   changed: (x agent1) from 3 to 2, (y agent1) from 3 to 2
   goals met: 1 of 2
19. (pour agent1 plant1)
   changed: (carrying) from 1 to 0, (poured plant1) from 2 to 3, (total_poured) from 2 to 3
   goals met: 1 of 2
20. (move_up_right agent1)
   changed: (y agent1) from 2 to 3, (x agent1) from 2 to 3
   goals met: 1 of 2
21. (move_up_right agent1)
   changed: (y agent1) from 3 to 4, (x agent1) from 3 to 4
   goals met: 1 of 2
22. (load agent1 tap1)
   changed: (carrying) from 0 to 1, (total_loaded) from 3 to 4
   goals met: 1 of 2
23. (move_down_left agent1)
   changed: (x agent1) from 4 to 3, (y agent1) from 4 to 3
   goals met: 1 of 2
24. (move_down_left agent1)
   changed: (x agent1) from 3 to 2, (y agent1) from 3 to 2
   goals met: 1 of 2
25. (pour agent1 plant1)
   changed: (carrying) from 1 to 0, (poured plant1) from 3 to 4, (total_poured) from 3 to 4
   goals met: 2 of 2
